app/controllers/articles_controller.rb

  def index
    @articles = Article.search(params[:search])
---
SELECT "articles".* FROM "articles" WHERE (title ILIKE '%begin%' OR body ILIKE '%begin%')

  def create
    @article = Article.new(article_params)

    respond_to do |format|
      if @article.save
---
INSERT INTO "articles" ("title", "body", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["title", "Hello Rails 5"], ["body", "Hi, im beginner with Rails"], ["created_at", 2017-02-08 15:20:05 UTC], ["updated_at", 2017-02-08 15:20:05 UTC]]

  def update
    respond_to do |format|
      if @article.update(article_params)
---
UPDATE "articles" SET "title" = $1, "body" = $2, "updated_at" = $3 WHERE "articles"."id" = $4  [["title", "Introduce my Application"], ["body", "This is an application for saving my memories."], ["updated_at", 2017-02-08 16:37:17 UTC], ["id", 2]]

  def search
    @articles = Article.find_by_title(params[:title])
---
SELECT  "articles".* FROM "articles" WHERE "articles"."title" = $1 LIMIT $2  [["title", "th"], ["LIMIT", 1]]